In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4), ['a', 'b', 'c', 'd', 'e'], ['w', 'x', 'y', 'z'])

In [5]:
df
# w, x, y, z são series que compartilham o msm index

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

### Select columns

In [6]:
display(df["w"])
print(type(df['w']))

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
e   -0.116773
Name: w, dtype: float64

<class 'pandas.core.series.Series'>

In [7]:
df[['x', 'z']]

          x         z
a  1.693723 -1.159119
b  0.390528  0.184502
c  0.072960  0.329646
d -0.754070  0.484752
e  1.901755  1.996652

### Creating column

In [8]:
df['new']

KeyError: 'new'

In [9]:
df['new'] = df['w'] + df['y']

In [10]:
df['new']

a   -1.403420
b    0.032064
c    1.446493
d   -1.440510
e    0.121354
Name: new, dtype: float64

In [11]:
df

          w         x         y         z       new
a  0.302665  1.693723 -1.706086 -1.159119 -1.403420
b -0.134841  0.390528  0.166905  0.184502  0.032064
c  0.807706  0.072960  0.638787  0.329646  1.446493
d -0.497104 -0.754070 -0.943406  0.484752 -1.440510
e -0.116773  1.901755  0.238127  1.996652  0.121354

### Drop column

In [12]:
df.drop('new', axis=1) # não esta afetenado o DataFrame

# axis = 0 -> row
# axis = 1 -> column

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [13]:
df

          w         x         y         z       new
a  0.302665  1.693723 -1.706086 -1.159119 -1.403420
b -0.134841  0.390528  0.166905  0.184502  0.032064
c  0.807706  0.072960  0.638787  0.329646  1.446493
d -0.497104 -0.754070 -0.943406  0.484752 -1.440510
e -0.116773  1.901755  0.238127  1.996652  0.121354

In [14]:
df.drop('new', axis=1, inplace=True)
# inplace = True -> O comando vai afetar o DataFrame

In [15]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

### Drop row

In [16]:
df.drop('e', inplace=True)

# axis = 0 (Default)

In [17]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752

In [18]:
print(df.shape)
print(df.ndim)

(4, 4)
2

### Select rows

In [19]:
df.loc['b'] # pelo rotulo

w   -0.134841
x    0.390528
y    0.166905
z    0.184502
Name: b, dtype: float64

In [20]:
df.iloc[1] # pelo index

w   -0.134841
x    0.390528
y    0.166905
z    0.184502
Name: b, dtype: float64

In [21]:
df.loc['b', 'y']
# linha b coluna y

0.16690463609281317

In [22]:
df.loc[['a', 'b'], ['w', 'y']]

          w         y
a  0.302665 -1.706086
b -0.134841  0.166905

## Conditional Selection

In [23]:
bool_df = df > 0
bool_df

       w      x      y      z
a   True   True  False  False
b  False   True   True   True
c   True   True   True   True
d  False  False  False   True

In [24]:
df[bool_df]
# os que não correspondem a condição
# retornam como NaN

          w         x         y         z
a  0.302665  1.693723       NaN       NaN
b       NaN  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d       NaN       NaN       NaN  0.484752

In [25]:
df[df>=0.1]

          w         x         y         z
a  0.302665  1.693723       NaN       NaN
b       NaN  0.390528  0.166905  0.184502
c  0.807706       NaN  0.638787  0.329646
d       NaN       NaN       NaN  0.484752

In [26]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752

In [27]:
df['w']>0

a     True
b    False
c     True
d    False
Name: w, dtype: bool

In [28]:
df['w']

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
Name: w, dtype: float64

In [29]:
df[df['w']>0]

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
c  0.807706  0.072960  0.638787  0.329646

In [30]:
resultdf = df[df['w']>0]

In [31]:
resultdf

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
c  0.807706  0.072960  0.638787  0.329646

In [32]:
resultdf['x']

a    1.693723
c    0.072960
Name: x, dtype: float64

In [33]:
df[df['w']>0]['x']

a    1.693723
c    0.072960
Name: x, dtype: float64

In [34]:
df[df['w']>0][['x', 'z']]

          x         z
a  1.693723 -1.159119
c  0.072960  0.329646

In [35]:
boolser = df['w']>0
result = df[boolser]

In [36]:
result

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
c  0.807706  0.072960  0.638787  0.329646

In [37]:
result[['y', 'x']]

          y         x
a -1.706086  1.693723
c  0.638787  0.072960

In [38]:
df[(df['w'] > 0) & (df['y'] < 0)]

# & => and
# | => or

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119

## More Index Details

In [39]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752

In [40]:
df.reset_index()

  index         w         x         y         z
0     a  0.302665  1.693723 -1.706086 -1.159119
1     b -0.134841  0.390528  0.166905  0.184502
2     c  0.807706  0.072960  0.638787  0.329646
3     d -0.497104 -0.754070 -0.943406  0.484752

In [41]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752

In [44]:
newind = 'CA NY WY OR'.split()

In [45]:
df['States'] = newind

In [46]:
df

          w         x         y         z States
a  0.302665  1.693723 -1.706086 -1.159119     CA
b -0.134841  0.390528  0.166905  0.184502     NY
c  0.807706  0.072960  0.638787  0.329646     WY
d -0.497104 -0.754070 -0.943406  0.484752     OR

In [47]:
df.set_index('States', inplace=True)

In [49]:
df

               w         x         y         z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752

In [50]:
df.loc['NY']

w   -0.134841
x    0.390528
y    0.166905
z    0.184502
Name: NY, dtype: float64

## Multi-Index and Index Hierarchy

In [51]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [53]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
print(hier_index)
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [54]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [55]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [56]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [57]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [61]:
df.index.names

FrozenList(['Groups', 'Num'])

In [59]:
df.index.names = ['Groups', "Num"]

In [62]:
df

                   A         B
Groups Num
G1     1    0.147027 -0.479448
       2    0.558769  1.024810
       3   -0.925874  1.862864
G2     1   -1.133817  0.610478
       2    0.386030  2.084019
       3   -0.376519  0.230336

In [65]:
print(df.loc['G2'].loc[2, 'B'])
print(df.loc['G2'].loc[2]['B'])

2.084018530338962
2.084018530338962

In [66]:
df.loc['G2', 2]['B']

2.084018530338962

In [67]:
df.xs(1, level="Num")

               A         B
Groups
G1      0.147027 -0.479448
G2     -1.133817  0.610478